## Setup

In [1]:
%load_ext sql

In [2]:
# Connect to sakila MySQL database
%sql mysql+mysqlconnector://iliarudiak:password@iliarudiak-macbook.local:3306/sakila

In [3]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Test query

In [5]:
%%sql
SELECT * FROM actor LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (2, 'NICK', 'WAHLBERG', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (3, 'ED', 'CHASE', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (4, 'JENNIFER', 'DAVIS', datetime.datetime(2006, 2, 15, 4, 34, 33)),
 (5, 'JOHNNY', 'LOLLOBRIGIDA', datetime.datetime(2006, 2, 15, 4, 34, 33))]